Core/src/src/DataProcessors/AzRyПриИзмененийОстатковЗапасаУведомитьВладельцаСклада/AzRyПриИзмененийОстатковЗапасаУведомитьВладельцаСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AzRyПриИзмененийОстатковЗапасаУведомитьВладельцаСклада</name>
</mdclass:DataProcessor>

Core/src/src/Documents/Событие/Событие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Событие</name>
  <basedOn>Document.Событие</basedOn>
  <basedOn>Document.ЗаданиеНаРаботу</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.СчетНаОплату</basedOn>
  <basedOn>Document.РасходСоСчета</basedOn>
  <basedOn>Document.РасходИзКассы</basedOn>
  <basedOn>Document.ПлатежноеПоручение</basedOn>
  <basedOn>Document.ПоступлениеНаСчет</basedOn>
  <basedOn>Document.ПоступлениеВКассу</basedOn>
  <basedOn>Document.ОтчетКомиссионера</basedOn>
  <basedOn>Document.ОтчетКомитенту</basedOn>
  <basedOn>Document.ОтчетОПереработке</basedOn>
  <basedOn>Document.ОтчетПереработчика</basedOn>
  <basedOn>Document.АктВыполненныхРабот</basedOn>
  <basedOn>Catalog.Контрагенты</basedOn>
  <basedOn>Document.СчетНаОплатуПоставщика</basedOn>
  <basedOn>Document.СверкаВзаиморасчетов</basedOn>
  <basedOn>Document.ОперацияПоПлатежнымКартам</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.ПриемИПередачаВРемонт</basedOn>
  <posting>Deny</posting>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <attributes>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.ТипыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.СостоянияСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящееИсходящееСобытие</name>
    <type>
      <types>EnumRef.ВходящееИсходящееСобытие</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ТемыСобытий</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузитьПриОткрытии</name>
    <comment>Признак необходимости загрузки письма с почтового сервера</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкиHTML</name>
    <comment>Структура картинок форматированного документа</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.СверкаВзаиморасчетов</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаданиеНаРаботу</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.РасходСоСчета</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.СчетФактура</types>
      <types>DocumentRef.ПоступлениеВКассу</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.СчетНаОплату</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
      <types>DocumentRef.Событие</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ПлатежноеПоручение</types>
      <types>CatalogRef.ПрайсЛисты</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.РасходИзКассы</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.МассоваяРассылка</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВходящееИсходящееСобытие</name>
    <type>
      <types>EnumRef.ВходящееИсходящееСобытие</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаИСодержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОтправителяSMS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КалендарьСотрудника</name>
    <type>
      <types>CatalogRef.КалендариСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.СверкаВзаиморасчетов</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЗаданиеНаРаботу</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.ОтчетОПереработке</types>
        <types>DocumentRef.СчетФактура</types>
        <types>DocumentRef.ПоступлениеВКассу</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ЗаказНаПроизводство</types>
        <types>DocumentRef.СчетНаОплату</types>
        <types>DocumentRef.ПриемИПередачаВРемонт</types>
        <types>DocumentRef.Событие</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.ПлатежноеПоручение</types>
        <types>CatalogRef.ПрайсЛисты</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>DocumentRef.РасходИзКассы</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.МассоваяРассылка</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
        <types>DocumentRef.СчетНаОплатуПоставщика</types>
        <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
        <types>String</types>
        <types>CatalogRef.Контрагенты</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КакСвязаться</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДляОтправки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСообщения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДоставки</name>
      <type>
        <types>EnumRef.СостоянияСообщенияSMS</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/DataProcessors/AzRyПриИзмененийОстатковЗапасаУведомитьВладельцаСклада/ObjectModule.bsl
&НаСервере
Процедура КомандаОтправитьПисьмо(НавигационнаяСсылка, Автор) Экспорт
	
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду("0000000267");
	
	Событие = Документы.Событие.СоздатьДокумент();
	Событие.Дата = ТекущаяДата();
	Событие.Тема = "ნაშთების ცვლილება საწყობზე: 'ალექსი ზვიადაძე' ";
	Событие.ТипСобытия     = Перечисления.ТипыСобытий.ЭлектронноеПисьмо;
	Событие.Состояние      = Справочники.СостоянияСобытий.Запланировано;
	Событие.Важность       = Перечисления.ВариантыВажности.Обычная;
	Событие.Ответственный  = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнойОтветственный");
	Событие.Автор          = Пользователи.АвторизованныйПользователь();
	Событие.УчетнаяЗапись  = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	//Событие.Содержание = ПолучитьТекст("გიორგი მამულაშვილი", "e1cib/data/Документ.Событие?ref=9179000c29f6a05711ed644dd1bd18e8");
	
	Событие.СодержаниеHTML = ПолучитьТекст_HTML(Автор.Наименование, НавигационнаяСсылка);
	
	НоваяСтрока = Событие.Участники.Добавить();
	НоваяСтрока.Контакт = Сотрудник.Наименование;
	НоваяСтрока.КакСвязаться = "aleksi.zviadadze@azry.com"; // TODO .. მეილი ასაღებია მოხმარებლის ობიექტიდან ან პროცედურას უნდა გადმოეცეს
	//НоваяСтрока.КакСвязаться = "teona.tsuleiskiri@azry.com";
	
	Событие.Записать();
	
	Событие.ОтправитьЭлектронноеПисьмо();
	
КонецПроцедуры

Функция ПолучитьТекст_HTML(АвторДокумента, СсылкаДокумента)

	Текст = "<table border=""1"" cellpadding=""1"" cellspacing=""1"" style=""width:500px"">";
	Текст = Текст + "<thead>";
	Текст = Текст + "<tr>";
	Текст = Текст + "<th scope=""col""><strong>დასახელება</strong></th>";
	Текст = Текст + "<th scope=""col""><strong>მნიშვნელობა</strong></th>";
	Текст = Текст + "</tr>";
	Текст = Текст + "</thead>";
	
	Текст = Текст + "<tbody>";
	Текст = Текст + "<tr>";
	Текст = Текст + "<td>ცვლილების ავტორი</td>";
	Текст = Текст + "<td>"+АвторДокумента+"</td>";
	Текст = Текст + "</tr>";
	Текст = Текст + "<tr>";
	Текст = Текст + "<td>დოკუმენტის ლინკი</td>";
	Текст = Текст + "<td>"+СсылкаДокумента+"</td>";
	Текст = Текст + "</tr>";
	Текст = Текст + "</tbody>";
	Текст = Текст + "</table>";
	
	Возврат Текст;

КонецФункции

Функция ПолучитьТекст(АвторДокумента, СсылкаДокумента)

	Текст = " ცვლილების ავტორი: &Парам1 <br>  
			 | დოკუმენტის ლინკი: &Парам2";
	
	Текст = СтрЗаменить(Текст, "&Парам1", АвторДокумента);
	Текст = СтрЗаменить(Текст, "&Парам2", СсылкаДокумента);
	
	Возврат Текст;

КонецФункции
